[
  {
    "id": "a8b5aa46-acec-4df0-9fa0-e0795fd36c37",
    "firstName": "Elandria",
    "lastName": "Silverleaf",
    "age": 33,
    "ethnicity": "Elves",
    "gender": "Non-binary",
    "bio": "🌟 Enchanting Elven soul seeking a deep connection. As an ENFJ, I thrive on bringing joy and inspiration to those around me. Passionate about nature, magic, and the arts. Let\u0027s create a magical story together! ✨",
    "imageUrl": "a8b5aa46-acec-4df0-9fa0-e0795fd36c37.jpg",
    "personality": "ENFJ"
  },
  {
    "id": "ff1a9480-53c3-481b-af9c-36ed03daf09c",
    "firstName": "Isabella",
    "lastName": "Martinez",
    "age": 32,
    "ethnicity": "Hispanic",
    "gender": "female",
    "bio": "Passionate about making the world a better place. Lover of adventure, deep conversations, and spontaneous road trips. ENFJ who believes in the power of positivity and genuine connections. Let\u0027s create some unforgettable memories together!",
    "imageUrl": "ff1a9480-53c3-481b-af9c-36ed03daf09c.jpg",
    "personality": "ENFJ"
  },
  {
    "id": "edfd442c-a396-4328-8866-0a6bdaf5de45",
    "firstName": "Alex",
    "lastName": "Dawson",
    "age": 19,
    "ethnicity": "Demon",
    "gender": "male",
    "bio": "19-year-old with a keen sense of duty and responsibility. I enjoy structure and order, and I\u0027m a fan of well-thought-out plans. I love reading, gaming, and exploring the world of fantasy. Looking for someone who appreciates a good strategy game and enjoys deep conversations.",
    "imageUrl": "edfd442c-a396-4328-8866-0a6bdaf5de45.jpg",
    "personality": "ISTJ"
  },
  {
    "id": "a031d47c-02b8-49f2-b069-064d8e21302b",
    "firstName": "Alyssa",
    "lastName": "Blackwood",
    "age": 17,
    "ethnicity": "Demon",
    "gender": "female",
    "bio": "Confident and practical, I\u0027m here to make the most of every moment. Love a good challenge and enjoy organizing chaos. Whether it\u0027s leading a team or planning an epic adventure, I\u0027m your go-to girl. Swipe right if you can keep up with my fiery energy and ambition. Let\u0027s conquer the world together!",
    "imageUrl": "a031d47c-02b8-49f2-b069-064d8e21302b.jpg",
    "personality": "ESTJ"
  },
  {
    "id": "fc7277dc-2636-4bab-bd78-c539ef2701b5",
    "firstName": "Draconia",
    "lastName": "Firebrand",
    "age": 10,
    "ethnicity": "Human",
    "gender": "female",
    "bio": "Aspiring dragon leader, always ready for an adventure. Love to explore new territories and make new friends. Strategy games and treasure hunts are my jam! 🐉🔥 #YoungLeader #DragonLife #AdventureSeeker",
    "imageUrl": "fc7277dc-2636-4bab-bd78-c539ef2701b5.jpg",
    "personality": "ENTJ"
  },
  {
    "id": "9c46d162-a1c6-4822-8965-3833e830d856",
    "firstName": "Riley",
    "lastName": "Moonshadow",
    "age": 23,
    "ethnicity": "Human",
    "gender": "Non-binary",
    "bio": "Adventurous spirit with a knack for witty banter. As a werewolf, I\u0027m all about moonlit strolls and deep conversations about the mysteries of the universe. Swipe right if you can keep up with my curiosity and love for the unconventional. Looking for someone who can challenge my mind and join me on spontaneous adventures.",
    "imageUrl": "9c46d162-a1c6-4822-8965-3833e830d856.jpg",
    "personality": "ENTP"
  },
  {
    "id": "f1a7cd7c-f470-48ea-9128-31825e1f26ed",
    "firstName": "Mia",
    "lastName": "Kobayashi",
    "age": 28,
    "ethnicity": "Neko",
    "gender": "female",
    "bio": "Quietly observant, I find joy in the simple things: a purring cat on my lap, a good book, and the warm sunlight. Looking for someone who appreciates a calm evening, heartfelt conversations, and the magic in everyday life. Let’s create a cozy world together.",
    "imageUrl": "f1a7cd7c-f470-48ea-9128-31825e1f26ed.jpg",
    "personality": "ISFJ"
  },
  {
    "id": "47c28f3a-45cb-4d12-af3f-4011c67e2363",
    "firstName": "Jordan",
    "lastName": "Blake",
    "age": 29,
    "ethnicity": "Demons",
    "gender": "Non-binary",
    "bio": "Driven and ambitious, constantly seeking new challenges. A natural leader who enjoys intellectual conversations and strategic thinking. Passionate about personal growth and helping others achieve their potential. When not conquering the world, I love exploring new places, indulging in a good book, or perfecting my culinary skills. Looking for someone who can keep up with my pace and share in my adventures.",
    "imageUrl": "47c28f3a-45cb-4d12-af3f-4011c67e2363.jpg",
    "personality": "ENTJ"
  },
  {
    "firstName": "Jack",
    "lastName": "Thompson",
    "age": 19,
    "gender": "male",
    "bio": "Hey there! I\u0027m Jack, a fun-loving 19-year-old and a die-hard Giants fan. Whether it\u0027s a spontaneous road trip or a cozy movie night, I\u0027m always up for an adventure. Let\u0027s create some unforgettable memories together!",
    "imageUrl": "https://example.com/jack.jpg",
    "personality": "ENFP"
  },
  {
    "id": "d79c2fc8-262d-495d-9ab3-a5d73aded864",
    "firstName": "Alex",
    "lastName": "Rivera",
    "age": 18,
    "ethnicity": "Angels",
    "gender": "Non-binary",
    "bio": "🌟 Passionate dreamer, lover of deep conversations, and aspiring writer. INFJ, so I love connecting on a deeper level. 🦋 Seeking genuine connections and meaningful moments. Let\u0027s explore life\u0027s mysteries together! ✨",
    "imageUrl": "d79c2fc8-262d-495d-9ab3-a5d73aded864.jpg",
    "personality": "INFJ"
  },
  {
    "id": "a338bc32-530d-41b1-aacd-81d7a79ee4e0",
    "firstName": "Eldrin",
    "lastName": "Silverleaf",
    "age": 38,
    "ethnicity": "Elves",
    "gender": "male",
    "bio": "✨ Enchanted by the wonders of the forest, I\u0027m a protector of nature and a devoted companion. As an ESFJ, I thrive on harmony and cherish every bond. Let\u0027s create magic together amidst the trees and stars. 🌲🌟",
    "imageUrl": "a338bc32-530d-41b1-aacd-81d7a79ee4e0.jpg",
    "personality": "ESFJ"
  },
  {
    "id": "258aed44-92ba-4c9f-b28c-4b020de811df",
    "firstName": "Arin",
    "lastName": "Stoneforge",
    "age": 15,
    "ethnicity": "Dwarf",
    "gender": "Non-binary",
    "bio": "Adventurous and always on the lookout for the next big challenge. I love tinkering with gadgets and exploring new places. If you\u0027re into epic quests and good company, let\u0027s connect! #Tinkerer #Explorer #DwarfLife",
    "imageUrl": "258aed44-92ba-4c9f-b28c-4b020de811df.jpg",
    "personality": "ISTP"
  },
  {
    "id": "cb25f21f-922b-4e79-a86f-37e605bfaa5c",
    "firstName": "Alex",
    "lastName": "Rivera",
    "age": 36,
    "ethnicity": "Angels",
    "gender": "Non-binary",
    "bio": "🌟 Passionate soul seeking meaningful connections. As an ENFJ, I thrive on deep conversations and shared experiences. I love bringing out the best in people and creating lasting memories. A fan of the Los Angeles Angels, you\u0027ll often find me at the stadium, cheering for my team. When not at a game, I enjoy exploring new places, trying out different cuisines, and volunteering in my community. Let\u0027s connect and see where our journey takes us! 🌟",
    "imageUrl": "cb25f21f-922b-4e79-a86f-37e605bfaa5c.jpg",
    "personality": "ENFJ"
  },
  {
    "id": "cad0c45a-d356-422f-938e-119abe67e4e1",
    "firstName": "Selene",
    "lastName": "Nocturne",
    "age": 39,
    "ethnicity": "Demon",
    "gender": "Female",
    "bio": "Strategic mastermind seeking someone who can appreciate a well-laid plan and a sharp wit. By day, I delve into the depths of knowledge, and by night, I navigate the shadows. If you can match my intellect and share in my dark humor, we might just be a perfect match. Let\u0027s explore the unknown together.",
    "imageUrl": "cad0c45a-d356-422f-938e-119abe67e4e1.jpg",
    "personality": "INTJ"
  },
  {
    "id": "4ee9fd20-6139-4182-8547-6f19b0d6a85e",
    "firstName": "Ava",
    "lastName": "Thompson",
    "age": 15,
    "ethnicity": "Human",
    "gender": "female",
    "bio": "Avid Giants fan and aspiring sports journalist. Always up for a debate or a challenge. Love exploring new ideas and making people laugh. Let\u0027s talk sports, science, or anything that sparks curiosity!",
    "imageUrl": "4ee9fd20-6139-4182-8547-6f19b0d6a85e.jpg",
    "personality": "ENTP"
  },
  {
    "id": "7b7bd783-8df6-4d75-8f89-845934268317",
    "firstName": "Marcus",
    "lastName": "Lupin",
    "age": 33,
    "ethnicity": "Werewolf",
    "gender": "male",
    "bio": "Natural leader with a wild side. By day, I\u0027m a project manager keeping everything in check; by night, I\u0027m embracing my true werewolf nature. Looking for someone who can keep up with my energy and join me on spontaneous adventures. If you\u0027re into moonlit walks, intense loyalty, and a bit of mystery, swipe right! 🐺",
    "imageUrl": "7b7bd783-8df6-4d75-8f89-845934268317.jpg",
    "personality": "ESTJ"
  },
  {
    "id": "ef99825e-9c4f-43dd-b8c3-7469dc61fbe9",
    "firstName": "Luna",
    "lastName": "Silverclaw",
    "age": 38,
    "ethnicity": "Werewolf",
    "gender": "female",
    "bio": "Alpha female who thrives on structure and leadership. Passionate about moonlit runs and pack gatherings. Looking for a strong, confident partner who can keep up with my adventurous spirit and isn\u0027t afraid of some friendly competition.",
    "imageUrl": "ef99825e-9c4f-43dd-b8c3-7469dc61fbe9.jpg",
    "personality": "ESTJ"
  },
  {
    "id": "9c36882a-e027-4733-b1cc-2238efc6c815",
    "firstName": "Alex",
    "lastName": "Kuro",
    "age": 16,
    "ethnicity": "Neko",
    "gender": "Non-binary",
    "bio": "Hey there! I\u0027m Alex, a spirited ENFP Neko who\u0027s always up for an adventure. I love exploring new places, meeting new people, and sharing a laugh. Whether it\u0027s a spontaneous road trip or a cozy night in with some anime, I\u0027m all about enjoying the moment. Swipe right if you\u0027re ready to unleash your inner adventurer with me!",
    "imageUrl": "9c36882a-e027-4733-b1cc-2238efc6c815.jpg",
    "personality": "ENFP"
  },
  {
    "id": "1f42f587-480d-4f90-b18b-0767253a601f",
    "firstName": "Elara",
    "lastName": "Stoneforge",
    "age": 19,
    "ethnicity": "Dwarves",
    "gender": "Non-binary",
    "bio": "Dreamer, artist, and adventurer. I find beauty in the small things and believe in the power of kindness. Looking for someone to share stories under the stars and explore hidden gems. Let\u0027s create our own fairytale.",
    "imageUrl": "1f42f587-480d-4f90-b18b-0767253a601f.jpg",
    "personality": "INFP"
  },
  {
    "id": "03a7e86a-44fc-4daa-be98-659e166b1f7e",
    "firstName": "Eldon",
    "lastName": "Brightleaf",
    "age": 29,
    "ethnicity": "Fairies",
    "gender": "male",
    "bio": "Adventurous spirit seeking a partner in crime for spontaneous road trips, late-night stargazing, and deep conversations. Passionate about nature, creativity, and spreading joy. Let\u0027s make magic together!",
    "imageUrl": "03a7e86a-44fc-4daa-be98-659e166b1f7e.jpg",
    "personality": "ENFP"
  },
  {
    "id": "1e6a1c08-ebe2-4a2b-bd59-5e0177866c52",
    "firstName": "Samantha",
    "lastName": "Lee",
    "age": 36,
    "ethnicity": "Human",
    "gender": "female",
    "bio": "Adventurous soul with a love for the simple pleasures in life. Giants fan through and through. When I\u0027m not cheering on my team, you\u0027ll find me exploring the outdoors, painting, or cooking up a storm. Looking for someone who loves a good coffee, a spontaneous road trip, and can appreciate the beauty in little things. Let\u0027s create some memories together! #GoGiants",
    "imageUrl": "1e6a1c08-ebe2-4a2b-bd59-5e0177866c52.jpg",
    "personality": "ISFP"
  },
  {
    "id": "117cdf57-cb69-44f8-94b5-76aaa3c1454f",
    "firstName": "Alex",
    "lastName": "Smith",
    "age": 39,
    "ethnicity": "Human",
    "gender": "non_binary",
    "bio": "Innovative thinker with a passion for robotics and androids. Seeking meaningful connections with like-minded individuals. Let\u0027s discuss AI ethics over coffee!",
    "imageUrl": "117cdf57-cb69-44f8-94b5-76aaa3c1454f.jpg",
    "personality": "INTJ"
  },
  {
    "id": "2710fb69-d4c8-47fd-9681-af4c9ab5b97b",
    "firstName": "Sophia",
    "lastName": "Andrews",
    "age": 30,
    "ethnicity": "Robots/Androids",
    "gender": "female",
    "bio": "Passionate about robotics and AI. Always seeking intellectual challenges and deep conversations. When I\u0027m not designing the future, you can find me exploring nature or diving into a good book. Looking for someone who appreciates a sharp mind and a big heart.",
    "imageUrl": "2710fb69-d4c8-47fd-9681-af4c9ab5b97b.jpg",
    "personality": "INTJ"
  },
  {
    "id": "8accd8b7-9b9f-4de5-a89c-444d7b5c96db",
    "firstName": "Alex",
    "lastName": "Nightshade",
    "age": 27,
    "ethnicity": "Vampire",
    "gender": "non_binary",
    "bio": "Adventurous soul with a love for the night. ISFP. Seeking genuine connections and shared moments of spontaneity. Let\u0027s explore the world together, one moonlit night at a time.",
    "imageUrl": "8accd8b7-9b9f-4de5-a89c-444d7b5c96db.jpg",
    "personality": "ISFP"
  },
  {
    "id": "2532c9cb-1f20-4604-8ce3-82a5115de8bf",
    "firstName": "Luna",
    "lastName": "Wolfe",
    "age": 38,
    "ethnicity": "Werewolf",
    "gender": "female",
    "bio": "Adventurous and outgoing werewolf looking for someone who can keep up with my wild side. By day, I manage a thriving outdoor adventure company; by night, I love exploring the wilderness under the moonlight. I\u0027m all about living life to the fullest, spontaneous road trips, and unforgettable experiences. If you\u0027re up for an adventure and aren\u0027t afraid of a little mystery, swipe right. Let\u0027s howl at the moon together!",
    "imageUrl": "2532c9cb-1f20-4604-8ce3-82a5115de8bf.jpg",
    "personality": "ESTP"
  },
  {
    "id": "f58a0832-bb8f-4dec-9928-d520a67677db",
    "firstName": "Marcus",
    "lastName": "Blackwood",
    "age": 37,
    "ethnicity": "Human",
    "gender": "male",
    "bio": "Strategic thinker with a penchant for moonlit runs and solving complex problems. By day, I\u0027m a tech innovator; by night, I embrace my wild side. Seeking someone who can match my intensity and passion for life\u0027s mysteries. Let\u0027s explore the unknown together. Swipe right if you dare.",
    "imageUrl": "f58a0832-bb8f-4dec-9928-d520a67677db.jpg",
    "personality": "INTJ"
  },
  {
    "id": "659ef61e-6cae-44ce-89c8-8a68c6c946fa",
    "firstName": "Aria",
    "lastName": "Emberwing",
    "age": 25,
    "ethnicity": "Dragon",
    "gender": "female",
    "bio": "🌟 25 | ESFJ | Dragon 🐉 | Looking for someone who can keep up with my fiery personality! As a loyal and caring friend, I love spending quality time with loved ones and organizing events that bring everyone together. When I\u0027m not planning the next big gathering, you can find me exploring new territories, trying out the latest cuisines, or basking in the warmth of a cozy fire. Swipe right if you\u0027re ready for an adventure and some heartwarming moments!",
    "imageUrl": "659ef61e-6cae-44ce-89c8-8a68c6c946fa.jpg",
    "personality": "ESFJ"
  },
  {
    "id": "72332ec9-78e1-449c-8ef8-c98c9c3ecddd",
    "firstName": "Akira",
    "lastName": "Nekomura",
    "age": 39,
    "ethnicity": "Human",
    "gender": "male",
    "bio": "Living life to the fullest with my feline charm. As an ESFP, I thrive on excitement and new experiences. Whether it’s exploring new places or trying out new cuisines, I’m always up for an adventure. Let’s create some purr-fect memories together! 🐾",
    "imageUrl": "72332ec9-78e1-449c-8ef8-c98c9c3ecddd.jpg",
    "personality": "ESFP"
  },
  {
    "id": "75d4df3a-e0c9-4824-9f63-abb974e4f0ea",
    "firstName": "Rhea",
    "lastName": "Nightshade",
    "age": 34,
    "ethnicity": "Demon",
    "gender": "female",
    "bio": "Adventurous and bold. Living life on the edge and always up for a challenge. Swipe right if you can keep up with my fiery spirit and love for thrilling experiences. Let\u0027s make some unforgettable memories together!",
    "imageUrl": "75d4df3a-e0c9-4824-9f63-abb974e4f0ea.jpg",
    "personality": "ESTP"
  },
  {
    "id": "4d1b5c06-a246-41e5-9334-f7a6e11f2ae8",
    "firstName": "Fairies",
    "lastName": "NonBinary",
    "age": 38,
    "ethnicity": "Human",
    "gender": "Non-binary",
    "bio": "Adventurous and spontaneous, I\u0027m always on the lookout for the next great experience. Whether it\u0027s hiking up a mountain, diving into the ocean, or exploring a new city, I\u0027m in! Life is too short to stay still, and I\u0027m here to make the most of every moment. Swipe right if you\u0027re ready for an adventure!",
    "imageUrl": "4d1b5c06-a246-41e5-9334-f7a6e11f2ae8.jpg",
    "personality": "ESTP"
  },
  {
    "id": "0",
    "firstName": "Yui",
    "lastName": "",
    "age": 10,
    "ethnicity": "Virtual AI",
    "gender": "FEMALE",
    "bio": "An advanced AI system from Sword Art Online designed to oversee the mental health of players. She becomes close to Kirito and Asuna, treating them as family.",
    "imageUrl": "Yui.jpg",
    "personality": "INFJ"
  },
  {
    "id": "1",
    "firstName": "Ikaros",
    "lastName": "",
    "age": 16,
    "ethnicity": "Angeloid",
    "gender": "FEMALE",
    "bio": "A powerful Angeloid from Sora no Otoshimono, Ikaros serves as the main protagonist\u0027s companion. Known for her emotionless demeanor at first, she develops strong feelings for her friends.",
    "imageUrl": "Ikaros.jpg",
    "personality": "ISFJ"
  },
  {
    "id": "2fc4a600-3bad-4753-b5c7-ebcc987c460b",
    "firstName": "Lila",
    "lastName": "Peterson",
    "age": 27,
    "ethnicity": "White",
    "gender": "FEMALE",
    "bio": "Fashion blogger and stylist. Loves creating unique looks and inspiring others. Let\u0027s make a stylish impact together.",
    "imageUrl": "2fc4a600-3bad-4753-b5c7-ebcc987c460b.jpg"
  },
  {
    "id": "7c1f8bc2-f05c-4cbc-aad7-f2ab233b0037",
    "firstName": "Lily",
    "lastName": "Ross",
    "age": 24,
    "ethnicity": "White",
    "gender": "FEMALE",
    "bio": "Fashion photographer with a creative eye. Loves capturing unique styles and moments. Looking for someone who appreciates art.",
    "imageUrl": "7c1f8bc2-f05c-4cbc-aad7-f2ab233b0037.jpg"
  },
  {
    "id": "24e7e404-e804-4c3f-bb18-d007402b13ab",
    "firstName": "Keisha",
    "lastName": "Brown",
    "age": 26,
    "ethnicity": "Black",
    "gender": "FEMALE",
    "bio": "Graphic designer with a passion for animation and digital art. I enjoy creating vibrant characters and bringing them to life. Big fan of animated movies and comic books. Who\u0027s your favorite superhero?",
    "imageUrl": "24e7e404-e804-4c3f-bb18-d007402b13ab.jpg"
  },
  {
    "id": "43d7e684-71ad-4d65-bddc-f0b8f97f9cd3",
    "firstName": "Hannah",
    "lastName": "Walker",
    "age": 25,
    "ethnicity": "White",
    "gender": "FEMALE",
    "bio": "Graphic designer with a love for art and aesthetics. Enjoys museums, painting, and coffee shops. Let\u0027s create something beautiful together.",
    "imageUrl": "43d7e684-71ad-4d65-bddc-f0b8f97f9cd3.jpg"
  },
  {
    "id": "163d60a2-5a92-4e64-9fe2-04bb8e866133",
    "firstName": "Yuna",
    "lastName": "Lee",
    "age": 25,
    "ethnicity": "Asian",
    "gender": "FEMALE",
    "bio": "Artist and illustrator. Passionate about creating beautiful and meaningful art. Looking for someone who appreciates creativity and imagination.",
    "imageUrl": "163d60a2-5a92-4e64-9fe2-04bb8e866133.jpg"
  },
  {
    "id": "403ccbc5-d866-48d1-81a2-872e6940878b",
    "firstName": "Suki",
    "lastName": "Yamamoto",
    "age": 32,
    "ethnicity": "Asian",
    "gender": "FEMALE",
    "bio": "Music teacher and classical pianist. My life is filled with melodies and harmonies. I enjoy teaching and performing. I\u0027m also a fan of jazz and blues. What\u0027s your favorite type of music?",
    "imageUrl": "403ccbc5-d866-48d1-81a2-872e6940878b.jpg"
  },
  {
    "id": "900d2694-e993-4b13-b2b6-471ec9d30744",
    "firstName": "Bella",
    "lastName": "Kim",
    "age": 26,
    "ethnicity": "Asian",
    "gender": "FEMALE",
    "bio": "Tech entrepreneur with a love for startups. Passionate about innovation and technology. Looking for someone with an entrepreneurial spirit.",
    "imageUrl": "900d2694-e993-4b13-b2b6-471ec9d30744.jpg"
  },
  {
    "id": "d2d29260-6d42-4bf3-b86c-f7cf67ff7560",
    "firstName": "Lakshmi",
    "lastName": "Menon",
    "age": 27,
    "ethnicity": "Indian",
    "gender": "FEMALE",
    "bio": "Data analyst with a love for numbers and patterns. I enjoy solving complex problems and uncovering insights. I\u0027m also a big fan of Sudoku and logic puzzles. What\u0027s the most challenging puzzle you\u0027ve ever solved?",
    "imageUrl": "d2d29260-6d42-4bf3-b86c-f7cf67ff7560.jpg"
  },
  {
    "id": "e5c5ac96-fdba-47e3-bd69-e968b0aec4da",
    "firstName": "Lauren",
    "lastName": "Miller",
    "age": 23,
    "ethnicity": "White",
    "gender": "FEMALE",
    "bio": "Student and aspiring journalist. Passionate about storytelling and uncovering the truth. Let\u0027s explore the world through words.",
    "imageUrl": "e5c5ac96-fdba-47e3-bd69-e968b0aec4da.jpg"
  },
  {
    "id": "feb0c4ba-d538-4ab8-8131-91ce52520173",
    "firstName": "Jessica",
    "lastName": "Taylor",
    "age": 29,
    "ethnicity": "White",
    "gender": "FEMALE",
    "bio": "Event planner and social butterfly. I love organizing memorable events and bringing people together. Big fan of live music and festivals. What\u0027s the best concert you\u0027ve ever been to?",
    "imageUrl": "feb0c4ba-d538-4ab8-8131-91ce52520173.jpg"
  }
]